OpenFOAM-7-master/etc/templates/closedVolumeRotating/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInitial        0.1;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInitial;

boundaryField
{
    wall
    {
        type            kqRWallFunction;
        value           uniform $kInitial;
    }
}

// ************************************************************************* //
